app/controllers/follows_controller.rb

      def following
        @user = User.find(params[:user_id])
        current_user.followees << @user
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `follows` (`follower_id`, `followee_id`, `created_at`, `updated_at`) VALUES (3, 1, '2020-11-24 10:22:08.538733', '2020-11-24 10:22:08.538733')

      def unfollow
        @user = User.find(params[:user_id])
        current_user.followed_users.find_by(followee_id: @user.id).destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `follows` WHERE `follows`.`id` = 5