app/controllers/tweets_controller.rb

    def index
        # collecting current user's followees id
        @followees_id = current_user.followees.map{|x| x[:id]}

        @all_tweets = Tweet.all.order(created_at: :desc)

        if params[:type]=="latest"
            @tweets = Tweet.where("user_id IN (?)", @followees_id).order(created_at: :desc)
            @all_tweets = Tweet.all.order(created_at: :desc)
        else
            @tweets = Tweet.where("user_id IN (?)", @followees_id).order(created_at: :asc)
            @all_tweets = Tweet.all.order(created_at: :asc)
---
SELECT `tweets`.* FROM `tweets` WHERE (user_id IN (3)) ORDER BY `tweets`.`created_at` DESC
SELECT `tweets`.* FROM `tweets` WHERE (user_id IN (NULL)) ORDER BY `tweets`.`created_at` DESC

    def create
    @tweet = Tweet.new(tweet_params)

    @tweet.user_id = current_user.id

    if @tweet.save
---
INSERT INTO `tweets` (`user_id`, `body`, `created_at`, `updated_at`) VALUES (1, 'My tweet', '2020-12-04 07:27:46.541394', '2020-12-04 07:27:46.541394')

    def destroy

        @tweet = Tweet.find(params[:id])

        @tweet.destroy
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 1