app/controllers/users_controller.rb

    def profile

        @userid = params[:user_id]

        @userinfo = User.find(params[:user_id])

        @usercount = @userinfo.tweets

        @tweets = Tweet.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `tweets`.* FROM `tweets` ORDER BY `tweets`.`created_at` DESC